'''
Паша очень любит кататься на общественном транспорте, а получая билет, сразу проверяет, счастливый ли ему попался. 
Билет считается счастливым, если сумма первых трех цифр совпадает с суммой последних трех цифр номера билета.
Однако Паша очень плохо считает в уме, поэтому попросил вас написать программу, которая проверит равенство сумм и выведет "Счастливый", 
если суммы совпадают, и "Обычный", если суммы различны.
На вход программе подаётся строка из шести цифр.
'''

p = int(input()) #ввод числа
p1 = p // 10
p2 = p % 10      #6 цифра
p3 = p1 // 10
p4 = p1 % 10     #5 цифра
p5 = p3 // 10
p6 = p3 % 10     #4 цифра
p7 = p5 // 10
p8 = p5 % 10     #3 цифра
p9 = p7 % 10     #2 цифра
p10 = p7 // 10   #1 цифра

if p10 + p9 + p8 == p6 + p4 + p2:
    print('Счастливый')
else:
    print('Обычный')
