'''
Напишите программу, которая считывает с консоли числа (по одному в строке) до тех пор, пока сумма введённых чисел 
не будет равна 0 и сразу после этого выводит сумму квадратов всех считанных чисел.
Гарантируется, что в какой-то момент сумма введённых чисел окажется равной 0, после этого считывание продолжать не нужно.
'''

i = 0
count = 0
count2 = 0
while i >= 0:
    num = int(input()) #считываем числа
    count += num #суммируем введенные числа
    count2 += num ** 2 #суммируем квадраты введенных чисел
    if count == 0 and i != 0: #если сумма чисел == 0 и при этом введено хотя бы два числа, то
        print(count2)  #выводим сумму квадратов чисел
        break #и завершаем цикл
    i += 1
