'''
Напишите программу, которая считывает целые числа с консоли по одному числу в строке.
Для каждого введённого числа проверить: если число меньше 10, то пропускаем это число;
если число больше 100, то прекращаем считывать числа; в остальных случаях вывести это число обратно на консоль 
в отдельной строке.
'''

i = 0
while i >= 0: #пробегаем по всем введенным числам с консоли
    a = int(input()) #ввод числа
    if a < 10:  #переходим к следующему числу
        continue
    elif a > 100: #завершаем выполнение программы  
        break
    else:  #выводим число на экран
        print(a)
        i += 1
