'''
Напишите программу, на вход которой подаётся список чисел одной строкой. Программа должна для каждого элемента этого 
списка вывести сумму двух его соседей. Для элементов списка, являющихся крайними, одним из соседей считается элемент, 
находящий на противоположном конце этого списка. Если на вход пришло только одно число, надо вывести его же.
Вывод должен содержать одну строку с числами нового списка, разделёнными пробелом.
'''

a = [int(i) for i in input().split()]  #считываем введённые числа
s = 0

if len(a) == 1:  #если ввели только одно число, то выводим его
    print(a[0])
else: # иначе пробегаем по всем введенным числам
    for j in range(len(a)): 
        if j == 0: #если число является первым из списка, то суммируем число справа и число с конца
            s = a[j + 1] + a[len(a) - 1]
        elif j == len(a) - 1: #если число последнее, то суммируем число слева и число в начале
            s = a[0] + a[len(a) - 2]
        else: #если число посередине, то суммируем числа слева и справа
            s = a[j - 1] + a[j + 1]
        print(s, end=' ')
