'''
Напишите программу, которая выводит часть последовательности 1 2 2 3 3 3 4 4 4 4 5 5 5 5 5 ... (число повторяется 
столько раз, чему равно). На вход программе передаётся неотрицательное целое число n — столько элементов последовательности 
должна отобразить программа. На выходе ожидается последовательность чисел, записанных через пробел в одну строку.
'''

n = int(input()) #вводится число элементов последовательности
i = 1
count = 0
while i <= n: #выводим последовательность нужной длины
    for j in range(1, i + 1): #выводим несколько раз одно и тоже число в зависимости от числа
        if count < n: #прерываем вывод повторяющегося числа, если мы достигли максимальной длины последовательности
            count += 1
            print(i, end=' ')
    i += 1
