'''
Напишите программу, на вход которой подаётся прямоугольная матрица в виде последовательности строк, 
заканчивающихся строкой, содержащей только строку "end" (без кавычек).
Программа должна вывести матрицу того же размера, у которой каждый элемент в позиции i, j равен сумме элементов первой 
матрицы на позициях (i-1, j), (i+1, j), (i, j-1), (i, j+1). У крайних символов соседний элемент находится с противоположной стороны матрицы.
В случае одной строки/столбца элемент сам себе является соседом по соответствующему направлению.

Sample Input:
9 5 3
0 7 -1
-5  2 9
end

Sample Output:
3 21  22
10  6 19
20  16  -1
'''

count = 0
matrix = [] #инициализируем пустой первичный список, куда будут записываться входные числа
while count >= 0: #записываем все вводимые числа в двумерный список
    sequence = [s for s in input().split()] #вводим построчно числа
    if sequence == ['end']: #если в строке ввели 'end', то завершаем наполнять список числами
        break
    else: #иначе продолжаем наполнять
        matrix += [sequence]
        count += 1

for i in range(len(matrix)): #переводим все строки в полученном списке к числам int 
    for j in range(len(matrix[0])):
        matrix[i][j] = int(matrix[i][j])

field_new = [[0 for v in range(len(matrix[0]))] for g in range(len(matrix))] #инициализируем пустую матрицу, в которую потом будем добавлять суммы чисел

for i in range(len(matrix)): #пробегаем все числа из первичного списка
    for j in range(len(matrix[0])):
        summa = 0
        for di in range(-1, 2): #пробегаем все смещения от выбранного числа по горизонтали
            x = i + di
            for dj in range(-1, 2): #пробегаем все смещения от выбранного числа по вертикали
                y = j + dj
                if (di == -1 and dj == 0) or (di == 1 and dj == 0) or (di == 0 and dj == -1) or (di == 0 and dj == 1): #если полученные смещения являются верными по требованию поставленной задачи 
                    if x == len(matrix): #если координата по горизонтали вышла за правую границу первичного списка, то
                        x = -x   #берём координату с другого края списка
                    elif y == len(matrix[0]): #если координата по вертикали вышла за правую границу первичного списка, то
                        y = -y   #берём координату с другого края списка
                    summa += matrix[x][y] #суммируем значения клеток
        field_new[i][j] = summa #полученную сумму записываем в клетку нового списка
        print(field_new[i][j], end=' ') #выводим значения нового списка
    print('')
