'''
Узнав, что ДНК не является случайной строкой, только что поступившие в Институт биоинформатики студенты 
группы информатиков предложили использовать алгоритм сжатия, который сжимает повторяющиеся символы в строке.
Кодирование осуществляется следующим образом:
s = 'aaaabbсaa' преобразуется в 'a4b2с1a2', то есть группы одинаковых символов исходной строки заменяются на 
этот символ и количество его повторений в этой позиции строки.
Напишите программу, которая считывает строку, кодирует её предложенным алгоритмом и выводит закодированную 
последовательность на стандартный вывод. Кодирование должно учитывать регистр символов.
'''

s = input()
i = 0
count = 1

while i < len(s): #пробегаем каждый символ по одному
    if i + 1 < len(s): # если символ не последний
        t = s[i]
        if s[i] == s[i + 1]: #если текущий символ = следующему
            count += 1
            t = s[i]
        else: #если текущий символ != следующему
            print(t + str(count), end='')
            count = 1
            t = s[i]
    else: # если символ последний
        t = s[i]
        print(t + str(count))
    i += 1 #берём следующую букву
